emacs/Org-translate/org-mode-guide.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2015-10-19 Mon 20:39 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Org-mode Guide</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Simon" />
<meta  name="keywords" content="org-mode guide" />
</head>
<body>
<div id="content">
<h1 class="title">Org-mode Guide</h1>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">1</span> Introduction/引言</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> Preface</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Org是一种记笔记的方式，维护TODO列表，使用一种快速有效的纯文本系统做项目计划。它也是一个创作和出版的系统，它支持与源码进行编程和重现性研究
这个文档是一个非常小的综合性的组织模式手册。它包含所有基本功能和命令，以及定制的重要提示。它的目的是用一下200也的手册为初学者提供向导。
</p>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> Installation</h3>
<div class="outline-text-3" id="text-1-2">
<p>
   注意：如果你使用的是Emacs分发版本中的Org或者XEmacs包，请跳过本节，直接到<a href="#orgtarget1">1.3</a>节【Activato】。
如果你已经从网络下载了Org（.zip/.tar或者一个git存档），你需要添加这个lisp子目录到Emacs加在路径。将下面这些代码添加到.emacs文件中：
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq load-path (cons "~/path/to/orgdir/lisp" load-path))
(setq load-path (cons "~/path/to/orgdir/contrib/lisp" load-path))
</pre>
</div>
<p>
如果你使用git或者tar ball获得Org，你需要运行以下命令生成加载信息，命令：
</p>

<p>
make autoloads
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">1.3</span> <a id="orgtarget1"></a> Activation</h3>
<div class="outline-text-3" id="text-1-3">
<p>
添加一下elisp代码到你的.emacs中。最后的四行代码将一些命令绑定到了全局的快捷键上。（可自选合适的按键组合）
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">;; The following lines are always needed.Choose your own keys.
(global-set-key "\C-cl" 'org-store-link)
(global-set-key "\C-ca" 'org-agenda)
(global-set-key "\C-cc" 'org-capture)
(global-set-key "\C-cb" 'org-iswitchb)
</pre>
</div>
<p>
这样我们打开".org"的文件是Emacs会自动记载Org模式。
</p>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">1.4</span> Feedback</h3>
<div class="outline-text-3" id="text-1-4">
<p>
如果你有关于Org的bug、问题或者好的想法，请发送邮件至Org邮件列表（emacs-orgmode@gun.org）。更多关于如何提交bug的方法，参见主要手册（main manual）。
</p>
</div>
</div>
</div>
<div id="outline-container-orgheadline14" class="outline-2">
<h2 id="orgheadline14"><span class="section-number-2">2</span> Document Structure/文档结构</h2>
<div class="outline-text-2" id="text-2">
<p>
Org是基于大纲的模式编写，并提供灵活的命令来编辑此类结构的文件。
</p>
</div>
<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">2.1</span> Outlines / 大纲</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Org是在大纲模式上实现的，大纲模式是以不同的层次结构组织文件。这是一种不错的文档表述方式。我们可以通过折叠（隐藏）和展开（现实）标题下内容的方式使文档只显示我们关注的部分，
</p>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">2.2</span> Headlines / 标题</h3>
<div class="outline-text-3" id="text-2-2">
<p>
我们使用标题来定义一个大纲的树型结构，标题以一个或多个星号从左边开始。例：
</p>
<div class="org-src-container">

<pre class="src src-org">* 一级标题
** 二级标题
*** 三级标题
    此处编写标题下内容。以上标题的格式：“*+空格+标题”
* 另一个一级标题
</pre>
</div>
<p>
在Org buffer里任意地方都可以定义脚注，且脚注的内容不会被导出。（C-c C-x f）
</p>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">2.3</span> Visibility cycling / 大纲的折叠与展开</h3>
<div class="outline-text-3" id="text-2-3">
<p>
缓冲区中的文本部分大纲下的内容可以折叠（隐藏），Org只使用两个按键（命令）使其隐藏和显示。在一个缓冲区中通过绑定了的TAB和S-TAB（Shift-Table）去控制各级标题的折叠、展开。
</p>

<p>
(TAB) 控制子标题的折叠、展开
</p>

<p>
(C-u TAB) 或者（Shift-TAB） 调用全部标题的折叠、展开命令。
</p>

<p>
(C-u C-u C-u TAB) 展开所有标题
</p>

<p>
Emacs刚打开Org文件时，所有的标题都是折叠的（OVERVIEW），只能看到顶级标题。
</p>

<p>
如果不想这样，可以通过设置org-startup-folded变量，或者在每个Org文件头部添加启动加载项：#+STARTUP:content / overview / showall.
</p>

<p>
比如：#+STARTUP:content ，将它添加到你的Org文件里再次打开文件，看看是什么效果。。。（目前我没尝试 ^_^!）
</p>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">2.4</span> Mtion / 快捷键</h3>
<div class="outline-text-3" id="text-2-4">
<p>
(C-c C-n) -&gt; 下一个标题
</p>

<p>
(C-c C-p) -&gt; 上一个标题
</p>

<p>
(C-c C-f) -&gt; 下一个同级标题
</p>

<p>
(C-c C-b) -&gt; 上一个同级标题
</p>

<p>
(C-c C-u) -&gt; 当前标题的最高级别的标题处（描述不清，自己试一试吧 ^_^）
</p>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10"><span class="section-number-3">2.5</span> <span class="todo TODO">TODO</span> Structure editing / 编辑</h3>
<div class="outline-text-3" id="text-2-5">
<p>
（M-RET）          1. 添加一个于当前级别相同的标题。如果当前光标在一个“列表项”中，点击此键会产生一个新的列表项。当光标在行的中间，会将此行分为两部分后半部分为新的同级标题部分。
</p>

<p>
（M-S-RET）        2. 插入一个与当前新的代办事项（TODO）
</p>

<p>
（TAB）            3. 调整当前行为合理的缩进格式
</p>

<p>
（M-left/right）   增减当前标题等级，每次加一个等级
</p>

<p>
（M-S-left/right） 增减当前标题及其子标题的等级，每次一个等级
</p>

<p>
（M-S-up/down）    移动（交换）同级子标题
</p>

<p>
（C-c C-w）        
</p>
</div>
</div>
<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">2.6</span> Sparse trees</h3>
</div>

<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">2.7</span> Plain lists / 列表</h3>
</div>

<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13"><span class="section-number-3">2.8</span> Footnotes / 脚注</h3>
</div>
</div>
<div id="outline-container-orgheadline15" class="outline-2">
<h2 id="orgheadline15"><span class="section-number-2">3</span> Tables/表格</h2>
</div>

<div id="outline-container-orgheadline16" class="outline-2">
<h2 id="orgheadline16"><span class="section-number-2">4</span> Hyperlinks/超链接</h2>
</div>

<div id="outline-container-orgheadline17" class="outline-2">
<h2 id="orgheadline17"><span class="section-number-2">5</span> <b>TODO</b> Items/TODO列表</h2>
</div>

<div id="outline-container-orgheadline18" class="outline-2">
<h2 id="orgheadline18"><span class="section-number-2">6</span> Tags/标记</h2>
</div>

<div id="outline-container-orgheadline19" class="outline-2">
<h2 id="orgheadline19"><span class="section-number-2">7</span> Properties/特性</h2>
</div>

<div id="outline-container-orgheadline20" class="outline-2">
<h2 id="orgheadline20"><span class="section-number-2">8</span> Dates and Times/日期和时间</h2>
</div>

<div id="outline-container-orgheadline21" class="outline-2">
<h2 id="orgheadline21"><span class="section-number-2">9</span> Capture-Refile-Archive/捕获-申请-档案</h2>
</div>

<div id="outline-container-orgheadline22" class="outline-2">
<h2 id="orgheadline22"><span class="section-number-2">10</span> Agenda Views/日程视图</h2>
</div>

<div id="outline-container-orgheadline23" class="outline-2">
<h2 id="orgheadline23"><span class="section-number-2">11</span> Markup for rich export/标记为富文本导出</h2>
</div>

<div id="outline-container-orgheadline24" class="outline-2">
<h2 id="orgheadline24"><span class="section-number-2">12</span> Exporting/导出</h2>
</div>

<div id="outline-container-orgheadline25" class="outline-2">
<h2 id="orgheadline25"><span class="section-number-2">13</span> Publishing/发布（出版）</h2>
</div>

<div id="outline-container-orgheadline26" class="outline-2">
<h2 id="orgheadline26"><span class="section-number-2">14</span> Working with source code/与源码一起工作</h2>
</div>

<div id="outline-container-orgheadline27" class="outline-2">
<h2 id="orgheadline27"><span class="section-number-2">15</span> Miscellaneous/其他</h2>
</div>

<div id="outline-container-orgheadline28" class="outline-2">
<h2 id="orgheadline28"><span class="section-number-2">16</span> GNU Free Documentation License/GUN免费文档许可证</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Simon</p>
<p class="date">Created: 2015-10-19 Mon 20:39</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>